In [1]:
import pandas as pd
import numpy as np

In [13]:
# 1.모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임
# 최대한 다양한 방법으로 특정한 행과 열을 선택한다.

np.random.seed(325)
df = pd.DataFrame(np.random.randint(100, size=(5, 5)),
                 columns=['c1','c2','c3','c4','c5'],
                 index=['r1','r2','r3','r4','r5'])
df

    c1  c2  c3  c4  c5
r1  57  73  47  59  45
r2   9  27  90  29  77
r3  28  21  12   7  43
r4  69  19  98  22  87
r5  75  63  11  58  70

In [19]:
df[['c1','c3','c5']]

    c1  c3  c5
r1  57  47  45
r2   9  90  77
r3  28  12  43
r4  69  98  87
r5  75  11  70

In [21]:
df.loc['r2':'r4']

    c1  c2  c3  c4  c5
r2   9  27  90  29  77
r3  28  21  12   7  43
r4  69  19  98  22  87

In [22]:
df.iloc[:3]

    c1  c2  c3  c4  c5
r1  57  73  47  59  45
r2   9  27  90  29  77
r3  28  21  12   7  43

In [24]:
df.loc[:'r2','c5']

r1    45
r2    77
Name: c5, dtype: int32

In [25]:
df[df.c1>50]

    c1  c2  c3  c4  c5
r1  57  73  47  59  45
r4  69  19  98  22  87
r5  75  63  11  58  70

In [29]:
# 2. 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
# 결측값의 개수를 파악해본다
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [30]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [34]:
891 - titanic.count()  #결측값 개수

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [40]:
# 3. sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수,
# 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.
titanic['sex'].value_counts().sort_values(ascending=False)

male      577
female    314
Name: sex, dtype: int64

In [41]:
titanic['age'].value_counts().sort_values(ascending=False)

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
14.50     1
0.67      1
24.50     1
20.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [42]:
titanic['class'].value_counts().sort_values(ascending=False)

Third     491
First     216
Second    184
Name: class, dtype: int64

In [43]:
titanic['alive'].value_counts().sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

In [72]:
# 4-1. 타이타닉호 승객의 평균 나이를 구하라.
round(np.mean(titanic.age), 2)  #29.7

29.7

In [73]:
# 4-2. 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
round(np.mean(titanic.loc[titanic.sex=='female','age']), 2)  #27.92

27.92

In [74]:
# 4-3. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
round(np.mean(titanic.loc[titanic['class']=='First','age']), 2)  #38.23

38.23

In [66]:
# 5. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 
# category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
# 20살이 넘으면 성별을 그대로 사용한다.
# 20살 미만이면 성별에 관계없이 “child”라고 한다.

titanic['category1'] = np.where(titanic.age>=20, titanic.sex, "child")
titanic.head()
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [79]:
# 6. 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 
# 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.
m_age = round(np.mean(titanic.age), 2)
m_age
titanic['age']=titanic['age'].fillna(m_age)
titanic['age'].count()  #891, 결측값 없음

891

In [81]:
# 7. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 
# category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.
# 성별을 나타내는 문자열 male 또는 female로 시작한다.
# 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
# 예를 들어 27살 남성은 male27 값이 된다.

titanic['category2'] = titanic['sex']+titanic['age'].astype(int).astype(str)
titanic['category2'].head()

0      male22
1    female38
2    female26
3    female35
4      male35
Name: category2, dtype: object

In [88]:
# 8.타이타닉호 승객을 '미성년자,'청년','중년','장년','노년' 나이 그룹으로
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
# 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다
(pd.cut(titanic['age'], bins, labels=labels).value_counts()) / titanic['age'].count()

청년      0.456790
중년      0.270483
미성년자    0.185185
장년      0.066218
노년      0.005612
Name: age, dtype: float64

In [102]:
# 9. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 
# category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.
# 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
# 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고
# 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

titanic['category3'] = pd.cut(titanic['age'], bins, labels=labels)
titanic['category3'] = np.where(titanic['age']<20, titanic['category3'], 
         titanic['category3'].astype(str)+["여성" if x=="female" else "남성" for x in titanic['sex']])
titanic['category3'].head()

0    청년남성
1    중년여성
2    청년여성
3    중년여성
4    중년남성
Name: category3, dtype: object

In [23]:
# 10. (다중인덱스)

np.random.seed(325)
df_score3 = pd.DataFrame(np.vstack([list('AAAAABBBBB'),
                                    list(range(1,6))*2,
                                    np.random.randint(100, size=(3,10))]).T,
                         columns=['반','번호','국어','영어','수학'])
df_score3

   반 번호  국어  영어  수학
0  A  1  57  28  75
1  A  2  73  21  63
2  A  3  47  12  11
3  A  4  59   7  58
4  A  5  45  43  70
5  B  1   9  69  58
6  B  2  27  19  32
7  B  3  90  98  21
8  B  4  29  22  24
9  B  5  77  87  67

In [30]:
df_score4 = df_score3.set_index(['반','번호'])
df_score4['평균'] = np.sum(df_score4.astype(int), axis=1)/len(df_score4)
df_score4

      국어  영어  수학    평균
반 번호
A 1   57  28  75  16.0
  2   73  21  63  15.7
  3   47  12  11   7.0
  4   59   7  58  12.4
  5   45  43  70  15.8
B 1    9  69  58  13.6
  2   27  19  32   7.8
  3   90  98  21  20.9
  4   29  22  24   7.5
  5   77  87  67  23.1

In [41]:
df_score5 = df_score4.unstack(1).stack(1).unstack(0)
df_score5

    국어      영어      수학        평균
반    A   B   A   B   A   B     A     B
번호
1   57   9  28  69  75  58  16.0  13.6
2   73  27  21  19  63  32  15.7   7.8
3   47  90  12  98  11  21   7.0  20.9
4   59  29   7  22  58  24  12.4   7.5
5   45  77  43  87  70  67  15.8  23.1